use [is1-26-tremasovad_db]

INSERT INTO Sizes(size_text) VALUES
	('XXS'),
	('XS'),
	('S'),
	('M'),
	('L'),
	('XL'),
	('XXL'),
	('XXXL');

INSERT INTO Colors(color_text) VALUES
	('Черный'),
	('Белый'),
	('Серый'),
	('Коричневый'),
	('Синий'),
	('Зеленый'),
	('Красный'),
	('Желтый'),
	('Оранжевый'),
	('Фиолетовый'),
	('Розовый'),
	('Бежевый'),
	('Голубой'),
	('Бордовый'),
	('Темно-синий'),
	('Серебряный'),
	('Золотой'),
	('Оливковый'),
	('Лаймовый'),
	('Черно-белый');

INSERT INTO Materials(material_text) VALUES
	('Шелк'),
	('Хлопок'),
	('Лен'),
	('Шерсть'),
	('Полиэстер'),
	('Шифон'),
	('Сатин'),
	('Вискоза'),
	('Жаккард'),
	('Тафта');

INSERT INTO Models(size, color, material) VALUES
	(3, 6, 1),
	(5, 5, 2),
	(2, 7, 4),
	(5, 2, 6),
	(5, 12, 5);

INSERT INTO Clients(client_name, client_surname, client_phone) VALUES
	('Bill', 'Grow', '89020736594'),
	('Alan', 'Cooper', '89020736544'),
	('Ted', 'Smith', '89021736594'),
	('Wayne', 'Anderson', '89420766594'),
	('Jake', 'Clark', '89020739594');

INSERT INTO Orders(date_of_order, prepaid_expense, total_cost, model, client) VALUES
	('2024-04-10', 7.50, 150, 1, 1),
	('2024-04-20', 20, 100, 2, 2),
	('2024-04-12', 100, 500, 2, 3),
	('2024-04-14', 200, 1000, 2, 3),
	('2024-05-1', 160, 800, 2, 3);
	
INSERT INTO Fittings(fitting_date, order_id) VALUES
	('2024-04-12', 1),
	('2024-04-16', 1),
	('2024-04-21', 2),
	('2024-04-24', 2),
	('2024-04-14', 3),
	('2024-04-16', 3),
	('2024-04-18', 4),
	('2024-04-19', 4),
	('2024-05-02', 5),
	('2024-05-05', 5);